Revit 2026 API

# RebarFreeFormCreationResult Class

---

Class that encapsulates the result of the rebar free form creation.

SystemObject Autodesk.Revit.DB.StructureRebarFreeFormCreationResult

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarFreeFormCreationResult : IDisposable
```
```vb
Public Class RebarFreeFormCreationResult
	Implements IDisposable
```
```cpp
public ref class RebarFreeFormCreationResult : IDisposable
```
```fsharp
type RebarFreeFormCreationResult =
    class
        interface IDisposable
    end
```

The RebarFreeFormCreationResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Error | Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Rebar | Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a  Rebar. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarFreeFormCreationResult |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace